vedderb/vesc_express/sdkconfig.defaults.esp32p4_nrw32n16c6
# CONFIG_BOOTLOADER_FACTORY_RESET is not set
# CONFIG_BOOTLOADER_APP_TEST is not set
CONFIG_BOOTLOADER_REGION_PROTECTION_ENABLE=y
CONFIG_BOOTLOADER_WDT_ENABLE=y
# CONFIG_BOOTLOADER_WDT_DISABLE_IN_USER_CODE is not set
CONFIG_BOOTLOADER_WDT_TIME_MS=9000
# CONFIG_BOOTLOADER_SKIP_VALIDATE_IN_DEEP_SLEEP is not set
# CONFIG_BOOTLOADER_SKIP_VALIDATE_ON_POWER_ON is not set
# CONFIG_BOOTLOADER_SKIP_VALIDATE_ALWAYS is not set
# default:
CONFIG_BOOTLOADER_RESERVE_RTC_SIZE=0
# CONFIG_BOOTLOADER_CUSTOM_RESERVE_RTC is not set
# end of Bootloader config

#
# Security features
#
# default:
CONFIG_SECURE_BOOT_V2_RSA_SUPPORTED=y
# default:
CONFIG_SECURE_BOOT_V2_ECC_SUPPORTED=y
# default:
CONFIG_SECURE_BOOT_V2_PREFERRED=y
# CONFIG_SECURE_SIGNED_APPS_NO_SECURE_BOOT is not set
# CONFIG_SECURE_BOOT is not set
# CONFIG_SECURE_FLASH_ENC_ENABLED is not set
# default:
CONFIG_SECURE_ROM_DL_MODE_ENABLED=y
# end of Security features

#
# Application manager
#
CONFIG_APP_COMPILE_TIME_DATE=y
# CONFIG_APP_EXCLUDE_PROJECT_VER_VAR is not set
# CONFIG_APP_EXCLUDE_PROJECT_NAME_VAR is not set
# CONFIG_APP_PROJECT_VER_FROM_CONFIG is not set
CONFIG_APP_RETRIEVE_LEN_ELF_SHA=9
# end of Application manager

# default:
CONFIG_ESP_ROM_HAS_CRC_LE=y
# default:
CONFIG_ESP_ROM_HAS_CRC_BE=y
# default:
CONFIG_ESP_ROM_UART_CLK_IS_XTAL=y
# default:
CONFIG_ESP_ROM_USB_SERIAL_DEVICE_NUM=6
# default:
CONFIG_ESP_ROM_USB_OTG_NUM=5
# default:
CONFIG_ESP_ROM_HAS_RETARGETABLE_LOCKING=y
# default:
CONFIG_ESP_ROM_GET_CLK_FREQ=y
# default:
CONFIG_ESP_ROM_HAS_RVFPLIB=y
# default:
CONFIG_ESP_ROM_HAS_HAL_WDT=y
# default:
CONFIG_ESP_ROM_HAS_HAL_SYSTIMER=y
# default:
CONFIG_ESP_ROM_SYSTIMER_INIT_PATCH=y
# default:
CONFIG_ESP_ROM_HAS_LAYOUT_TABLE=y
# default:
CONFIG_ESP_ROM_WDT_INIT_PATCH=y
# default:
CONFIG_ESP_ROM_HAS_LP_ROM=y
# default:
CONFIG_ESP_ROM_WITHOUT_REGI2C=y
# default:
CONFIG_ESP_ROM_HAS_NEWLIB=y
# default:
CONFIG_ESP_ROM_HAS_NEWLIB_NANO_FORMAT=y
# default:
CONFIG_ESP_ROM_HAS_NEWLIB_NANO_PRINTF_FLOAT_BUG=y
# default:
CONFIG_ESP_ROM_HAS_VERSION=y
# default:
CONFIG_ESP_ROM_CLIC_INT_TYPE_PATCH=y
# default:
CONFIG_ESP_ROM_HAS_OUTPUT_PUTC_FUNC=y
# default:
CONFIG_ESP_ROM_HAS_SUBOPTIMAL_NEWLIB_ON_MISALIGNED_MEMORY=y

#
# Boot ROM Behavior
#
CONFIG_BOOT_ROM_LOG_ALWAYS_ON=y
# CONFIG_BOOT_ROM_LOG_ALWAYS_OFF is not set
# CONFIG_BOOT_ROM_LOG_ON_GPIO_HIGH is not set
# CONFIG_BOOT_ROM_LOG_ON_GPIO_LOW is not set
# end of Boot ROM Behavior

#
# Serial flasher config
#
# CONFIG_ESPTOOLPY_NO_STUB is not set
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
# CONFIG_ESPTOOLPY_FLASHMODE_QOUT is not set
# CONFIG_ESPTOOLPY_FLASHMODE_DIO is not set
# CONFIG_ESPTOOLPY_FLASHMODE_DOUT is not set
CONFIG_ESPTOOLPY_FLASH_SAMPLE_MODE_STR=y
# default:
CONFIG_ESPTOOLPY_FLASHMODE="dio"
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
# CONFIG_ESPTOOLPY_FLASHFREQ_20M is not set
# default:
CONFIG_ESPTOOLPY_FLASHFREQ_VAL=40
# default:
CONFIG_ESPTOOLPY_FLASHFREQ="40m"
# CONFIG_ESPTOOLPY_FLASHSIZE_1MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_2MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_4MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_8MB is not set
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# CONFIG_ESPTOOLPY_FLASHSIZE_32MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_64MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_128MB is not set
# default:
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
# CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE is not set
CONFIG_ESPTOOLPY_BEFORE_RESET=y
# CONFIG_ESPTOOLPY_BEFORE_NORESET is not set
# default:
CONFIG_ESPTOOLPY_BEFORE="default_reset"
CONFIG_ESPTOOLPY_AFTER_RESET=y
# CONFIG_ESPTOOLPY_AFTER_NORESET is not set
# default:
CONFIG_ESPTOOLPY_AFTER="hard_reset"
# default:
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200
# end of Serial flasher config

#
# Partition Table
#
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
# CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE is not set
# CONFIG_PARTITION_TABLE_TWO_OTA is not set
# CONFIG_PARTITION_TABLE_TWO_OTA_LARGE is not set
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partition_ota_16mb.csv"
# default:
CONFIG_PARTITION_TABLE_FILENAME="partition_ota_16mb.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y
# end of Partition Table

#
# XPT2046
#
CONFIG_XPT2046_Z_THRESHOLD=400
# CONFIG_XPT2046_INTERRUPT_MODE is not set
# CONFIG_XPT2046_VREF_ON_MODE is not set
CONFIG_XPT2046_CONVERT_ADC_TO_COORDS=y
# CONFIG_XPT2046_ENABLE_LOCKING is not set
# end of XPT2046

#
# Compiler options
#
# CONFIG_COMPILER_OPTIMIZATION_DEBUG is not set
# CONFIG_COMPILER_OPTIMIZATION_SIZE is not set
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# CONFIG_COMPILER_OPTIMIZATION_NONE is not set
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT is not set
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE is not set
CONFIG_COMPILER_ASSERT_NDEBUG_EVALUATE=y
# CONFIG_COMPILER_FLOAT_LIB_FROM_GCCLIB is not set
CONFIG_COMPILER_FLOAT_LIB_FROM_RVFPLIB=y
# default:
CONFIG_COMPILER_OPTIMIZATION_ASSERTION_LEVEL=2
# CONFIG_COMPILER_OPTIMIZATION_CHECKS_SILENT is not set
CONFIG_COMPILER_HIDE_PATHS_MACROS=y
# CONFIG_COMPILER_CXX_EXCEPTIONS is not set
# CONFIG_COMPILER_CXX_RTTI is not set
CONFIG_COMPILER_STACK_CHECK_MODE_NONE=y
# CONFIG_COMPILER_STACK_CHECK_MODE_NORM is not set
# CONFIG_COMPILER_STACK_CHECK_MODE_STRONG is not set
# CONFIG_COMPILER_STACK_CHECK_MODE_ALL is not set
# CONFIG_COMPILER_NO_MERGE_CONSTANTS is not set
# CONFIG_COMPILER_WARN_WRITE_STRINGS is not set
# CONFIG_COMPILER_SAVE_RESTORE_LIBCALLS is not set
CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=y
# CONFIG_COMPILER_DISABLE_GCC12_WARNINGS is not set
# CONFIG_COMPILER_DISABLE_GCC13_WARNINGS is not set
# CONFIG_COMPILER_DISABLE_GCC14_WARNINGS is not set
# CONFIG_COMPILER_DUMP_RTL_FILES is not set
CONFIG_COMPILER_RT_LIB_GCCLIB=y
# default:
CONFIG_COMPILER_RT_LIB_NAME="gcc"
CONFIG_COMPILER_ORPHAN_SECTIONS_WARNING=y
# CONFIG_COMPILER_ORPHAN_SECTIONS_PLACE is not set
# CONFIG_COMPILER_STATIC_ANALYZER is not set
# end of Compiler options

#
# Component config
#

#
# Application Level Tracing
#
# CONFIG_APPTRACE_DEST_JTAG is not set
CONFIG_APPTRACE_DEST_NONE=y
# CONFIG_APPTRACE_DEST_UART1 is not set
# CONFIG_APPTRACE_DEST_UART2 is not set
CONFIG_APPTRACE_DEST_UART_NONE=y
CONFIG_APPTRACE_UART_TASK_PRIO=1
# default:
CONFIG_APPTRACE_LOCK_ENABLE=y
# end of Application Level Tracing

#
# Bluetooth
#
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
# CONFIG_BT_NIMBLE_ENABLED is not set
CONFIG_BT_CONTROLLER_DISABLED=y

#
# Bluedroid Options
#
# default:
CONFIG_BT_BTC_TASK_STACK_SIZE=3072
# default:
CONFIG_BT_BLUEDROID_PINNED_TO_CORE_0=y
# default:
# CONFIG_BT_BLUEDROID_PINNED_TO_CORE_1 is not set
# default:
CONFIG_BT_BLUEDROID_PINNED_TO_CORE=0
# default:
CONFIG_BT_BTU_TASK_STACK_SIZE=4352
# default:
CONFIG_BT_BLUEDROID_ESP_COEX_VSC=y
# CONFIG_BT_CLASSIC_ENABLED is not set
# default:
CONFIG_BT_BLE_ENABLED=y
# default:
CONFIG_BT_GATTS_ENABLE=y
# default:
# CONFIG_BT_GATTS_PPCP_CHAR_GAP is not set
# default:
# CONFIG_BT_BLE_BLUFI_ENABLE is not set
# default:
CONFIG_BT_GATT_MAX_SR_PROFILES=8
# default:
CONFIG_BT_GATT_MAX_SR_ATTRIBUTES=100
# default:
# CONFIG_BT_GATTS_SEND_SERVICE_CHANGE_MANUAL is not set
# default:
CONFIG_BT_GATTS_SEND_SERVICE_CHANGE_AUTO=y
# default:
CONFIG_BT_GATTS_SEND_SERVICE_CHANGE_MODE=0
# default:
# CONFIG_BT_GATTS_ROBUST_CACHING_ENABLED is not set
# default:
# CONFIG_BT_GATTS_DEVICE_NAME_WRITABLE is not set
# default:
# CONFIG_BT_GATTS_APPEARANCE_WRITABLE is not set
# default:
# CONFIG_BT_GATTS_SECURITY_LEVELS_CHAR is not set
# default:
# CONFIG_BT_GATTS_KEY_MATERIAL_CHAR is not set
# default:
CONFIG_BT_GATTC_ENABLE=y
# default:
CONFIG_BT_GATTC_MAX_CACHE_CHAR=40
# default:
CONFIG_BT_GATTC_NOTIF_REG_MAX=5
# default:
# CONFIG_BT_GATTC_CACHE_NVS_FLASH is not set
# default:
CONFIG_BT_GATTC_CONNECT_RETRY_COUNT=3
# default:
CONFIG_BT_BLE_ESTAB_LINK_CONN_TOUT=30
# default:
CONFIG_BT_BLE_SMP_ENABLE=y
# default:
# CONFIG_BT_SMP_SLAVE_CON_PARAMS_UPD_ENABLE is not set
# default:
# CONFIG_BT_BLE_SMP_ID_RESET_ENABLE is not set
# default:
CONFIG_BT_BLE_SMP_BOND_NVS_FLASH=y
# default:
CONFIG_BT_BLE_RPA_SUPPORTED=y

#
# Bluedroid debug option
#
# default:
# CONFIG_BT_BLUEDROID_MEM_DEBUG is not set
# default:
# CONFIG_BT_BLUEDROID_MEM_STATS is not set
# default:
# CONFIG_BT_BLUEDROID_THREAD_DEBUG is not set
# end of Bluedroid debug option

# default:
# CONFIG_BT_STACK_NO_LOG is not set

