vedderb/vesc_express/sdkconfig.defaults.esp32p4_nrw32n16c6
#
# BT DEBUG LOG LEVEL
#
# default:
# CONFIG_BT_LOG_HCI_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_HCI_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_HCI_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_HCI_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_HCI_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_HCI_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_HCI_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_HCI_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_BTM_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_BTM_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_BTM_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_BTM_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_BTM_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_BTM_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_BTM_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_BTM_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_L2CAP_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_L2CAP_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_L2CAP_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_L2CAP_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_L2CAP_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_L2CAP_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_L2CAP_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_L2CAP_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_RFCOMM_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_RFCOMM_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_RFCOMM_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_RFCOMM_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_RFCOMM_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_RFCOMM_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_RFCOMM_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_RFCOMM_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_SDP_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_SDP_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_SDP_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_SDP_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_SDP_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_SDP_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_SDP_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_SDP_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_GAP_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_GAP_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_GAP_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_GAP_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_GAP_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_GAP_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_GAP_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_GAP_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_BNEP_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_BNEP_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_BNEP_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_BNEP_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_BNEP_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_BNEP_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_BNEP_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_BNEP_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_PAN_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_PAN_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_PAN_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_PAN_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_PAN_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_PAN_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_PAN_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_PAN_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_A2D_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_A2D_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_A2D_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_A2D_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_A2D_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_A2D_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_A2D_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_A2D_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_AVDT_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_AVDT_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_AVDT_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_AVDT_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_AVDT_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_AVDT_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_AVDT_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_AVDT_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_AVCT_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_AVCT_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_AVCT_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_AVCT_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_AVCT_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_AVCT_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_AVCT_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_AVCT_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_AVRC_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_AVRC_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_AVRC_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_AVRC_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_AVRC_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_AVRC_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_AVRC_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_AVRC_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_MCA_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_MCA_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_MCA_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_MCA_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_MCA_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_MCA_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_MCA_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_MCA_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_HID_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_HID_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_HID_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_HID_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_HID_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_HID_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_HID_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_HID_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_APPL_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_APPL_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_APPL_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_APPL_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_APPL_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_APPL_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_APPL_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_APPL_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_GATT_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_GATT_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_GATT_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_GATT_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_GATT_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_GATT_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_GATT_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_GATT_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_SMP_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_SMP_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_SMP_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_SMP_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_SMP_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_SMP_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_SMP_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_SMP_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_BTIF_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_BTIF_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_BTIF_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_BTIF_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_BTIF_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_BTIF_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_BTIF_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_BTIF_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_BTC_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_BTC_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_BTC_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_BTC_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_BTC_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_BTC_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_BTC_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_BTC_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_OSI_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_OSI_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_OSI_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_OSI_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_OSI_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_OSI_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_OSI_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_OSI_TRACE_LEVEL=2
# default:
# CONFIG_BT_LOG_BLUFI_TRACE_LEVEL_NONE is not set
# default:
# CONFIG_BT_LOG_BLUFI_TRACE_LEVEL_ERROR is not set
# default:
CONFIG_BT_LOG_BLUFI_TRACE_LEVEL_WARNING=y
# default:
# CONFIG_BT_LOG_BLUFI_TRACE_LEVEL_API is not set
# default:
# CONFIG_BT_LOG_BLUFI_TRACE_LEVEL_EVENT is not set
# default:
# CONFIG_BT_LOG_BLUFI_TRACE_LEVEL_DEBUG is not set
# default:
# CONFIG_BT_LOG_BLUFI_TRACE_LEVEL_VERBOSE is not set
# default:
CONFIG_BT_LOG_BLUFI_TRACE_LEVEL=2
# end of BT DEBUG LOG LEVEL

# default:
CONFIG_BT_ACL_CONNECTIONS=4
# default:
CONFIG_BT_MULTI_CONNECTION_ENBALE=y
# default:
# CONFIG_BT_ALLOCATION_FROM_SPIRAM_FIRST is not set
# default:
# CONFIG_BT_BLE_DYNAMIC_ENV_MEMORY is not set
# default:
CONFIG_BT_SMP_ENABLE=y
# default:
CONFIG_BT_SMP_MAX_BONDS=15
# default:
# CONFIG_BT_BLE_ACT_SCAN_REP_ADV_SCAN is not set
# default:
CONFIG_BT_MAX_DEVICE_NAME_LEN=32
# default:
CONFIG_BT_BLE_RPA_TIMEOUT=900
# CONFIG_BT_BLE_50_FEATURES_SUPPORTED is not set
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
# default:
CONFIG_BT_BLE_42_DTM_TEST_EN=y
# default:
CONFIG_BT_BLE_42_ADV_EN=y
# default:
CONFIG_BT_BLE_42_SCAN_EN=y
# default:
CONFIG_BT_BLE_VENDOR_HCI_EN=y
# default:
# CONFIG_BT_BLE_HIGH_DUTY_ADV_INTERVAL is not set
# default:
# CONFIG_BT_ABORT_WHEN_ALLOCATION_FAILS is not set
# end of Bluedroid Options

#
# Common Options
#
# default:
CONFIG_BT_ALARM_MAX_NUM=50
# default:
# CONFIG_BT_SMP_CRYPTO_STACK_NATIVE is not set
# default:
CONFIG_BT_SMP_CRYPTO_STACK_TINYCRYPT=y
# default:
# CONFIG_BT_SMP_CRYPTO_STACK_MBEDTLS is not set

#
# BLE Log
#
# CONFIG_BLE_LOG_ENABLED is not set
# end of BLE Log

# CONFIG_BT_BLE_LOG_SPI_OUT_ENABLED is not set
# CONFIG_BT_BLE_LOG_UHCI_OUT_ENABLED is not set
# CONFIG_BT_LE_USED_MEM_STATISTICS_ENABLED is not set
# end of Common Options

# default:
# CONFIG_BT_HCI_LOG_DEBUG_EN is not set
# end of Bluetooth

# default:
# CONFIG_BLE_MESH is not set

#
# Console Library
#
# CONFIG_CONSOLE_SORTED_HELP is not set
# end of Console Library

#
# Driver Configurations
#

#
# Legacy TWAI Driver Configurations
#
# CONFIG_TWAI_SKIP_LEGACY_CONFLICT_CHECK is not set
# end of Legacy TWAI Driver Configurations

#
# Legacy ADC Driver Configuration
#
# CONFIG_ADC_SUPPRESS_DEPRECATE_WARN is not set
# CONFIG_ADC_SKIP_LEGACY_CONFLICT_CHECK is not set

#
# Legacy ADC Calibration Configuration
#
# CONFIG_ADC_CALI_SUPPRESS_DEPRECATE_WARN is not set
# end of Legacy ADC Calibration Configuration
# end of Legacy ADC Driver Configuration

#
# Legacy MCPWM Driver Configurations
#
# CONFIG_MCPWM_SUPPRESS_DEPRECATE_WARN is not set
# CONFIG_MCPWM_SKIP_LEGACY_CONFLICT_CHECK is not set
# end of Legacy MCPWM Driver Configurations

#
# Legacy Timer Group Driver Configurations
#
# CONFIG_GPTIMER_SUPPRESS_DEPRECATE_WARN is not set
# CONFIG_GPTIMER_SKIP_LEGACY_CONFLICT_CHECK is not set
# end of Legacy Timer Group Driver Configurations

#
# Legacy RMT Driver Configurations
#
# CONFIG_RMT_SUPPRESS_DEPRECATE_WARN is not set
# CONFIG_RMT_SKIP_LEGACY_CONFLICT_CHECK is not set
# end of Legacy RMT Driver Configurations

#
# Legacy I2S Driver Configurations
#
# CONFIG_I2S_SUPPRESS_DEPRECATE_WARN is not set
# CONFIG_I2S_SKIP_LEGACY_CONFLICT_CHECK is not set
# end of Legacy I2S Driver Configurations

#
# Legacy I2C Driver Configurations
#
# CONFIG_I2C_SKIP_LEGACY_CONFLICT_CHECK is not set
# end of Legacy I2C Driver Configurations

#
# Legacy PCNT Driver Configurations
#
# CONFIG_PCNT_SUPPRESS_DEPRECATE_WARN is not set
# CONFIG_PCNT_SKIP_LEGACY_CONFLICT_CHECK is not set
# end of Legacy PCNT Driver Configurations

#
# Legacy SDM Driver Configurations
#
# CONFIG_SDM_SUPPRESS_DEPRECATE_WARN is not set
# CONFIG_SDM_SKIP_LEGACY_CONFLICT_CHECK is not set
# end of Legacy SDM Driver Configurations

#
# Legacy Temperature Sensor Driver Configurations
#
# CONFIG_TEMP_SENSOR_SUPPRESS_DEPRECATE_WARN is not set
# CONFIG_TEMP_SENSOR_SKIP_LEGACY_CONFLICT_CHECK is not set
# end of Legacy Temperature Sensor Driver Configurations

#
# Legacy Touch Sensor Driver Configurations
#
# CONFIG_TOUCH_SUPPRESS_DEPRECATE_WARN is not set
# CONFIG_TOUCH_SKIP_LEGACY_CONFLICT_CHECK is not set
# end of Legacy Touch Sensor Driver Configurations
# end of Driver Configurations

#
# eFuse Bit Manager
#
# CONFIG_EFUSE_CUSTOM_TABLE is not set
# CONFIG_EFUSE_VIRTUAL is not set
# default:
CONFIG_EFUSE_MAX_BLK_LEN=256
# end of eFuse Bit Manager

#
# ESP-TLS
#
CONFIG_ESP_TLS_USING_MBEDTLS=y
# CONFIG_ESP_TLS_USE_SECURE_ELEMENT is not set
CONFIG_ESP_TLS_USE_DS_PERIPHERAL=y
# CONFIG_ESP_TLS_CLIENT_SESSION_TICKETS is not set
# CONFIG_ESP_TLS_SERVER_SESSION_TICKETS is not set
# CONFIG_ESP_TLS_SERVER_CERT_SELECT_HOOK is not set
# CONFIG_ESP_TLS_SERVER_MIN_AUTH_MODE_OPTIONAL is not set
# CONFIG_ESP_TLS_PSK_VERIFICATION is not set
# CONFIG_ESP_TLS_INSECURE is not set
# default:
CONFIG_ESP_TLS_DYN_BUF_STRATEGY_SUPPORTED=y
# end of ESP-TLS

#
# ADC and ADC Calibration
#
# CONFIG_ADC_ONESHOT_CTRL_FUNC_IN_IRAM is not set
# CONFIG_ADC_CONTINUOUS_ISR_IRAM_SAFE is not set
# CONFIG_ADC_ENABLE_DEBUG_LOG is not set
# end of ADC and ADC Calibration

#
# Wireless Coexistence
#
# CONFIG_ESP_COEX_GPIO_DEBUG is not set
# end of Wireless Coexistence

#
# Common ESP-related
#
CONFIG_ESP_ERR_TO_NAME_LOOKUP=y
# end of Common ESP-related

#
# ESP-Driver:Analog Comparator Configurations
#
CONFIG_ANA_CMPR_ISR_HANDLER_IN_IRAM=y
# CONFIG_ANA_CMPR_CTRL_FUNC_IN_IRAM is not set
# CONFIG_ANA_CMPR_ISR_CACHE_SAFE is not set
# default:
CONFIG_ANA_CMPR_OBJ_CACHE_SAFE=y
# CONFIG_ANA_CMPR_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:Analog Comparator Configurations

#
# ESP-Driver:BitScrambler Configurations
#
# CONFIG_BITSCRAMBLER_CTRL_FUNC_IN_IRAM is not set
# end of ESP-Driver:BitScrambler Configurations

#
# ESP-Driver:Camera Controller Configurations
#
# CONFIG_CAM_CTLR_MIPI_CSI_ISR_CACHE_SAFE is not set
# CONFIG_CAM_CTLR_ISP_DVP_ISR_CACHE_SAFE is not set
# CONFIG_CAM_CTLR_DVP_CAM_ISR_CACHE_SAFE is not set
# end of ESP-Driver:Camera Controller Configurations

#
# ESP-Driver:GPIO Configurations
#
# CONFIG_GPIO_CTRL_FUNC_IN_IRAM is not set
# end of ESP-Driver:GPIO Configurations

#
# ESP-Driver:GPTimer Configurations
#
CONFIG_GPTIMER_ISR_HANDLER_IN_IRAM=y
# CONFIG_GPTIMER_CTRL_FUNC_IN_IRAM is not set
# CONFIG_GPTIMER_ISR_CACHE_SAFE is not set
# default:
CONFIG_GPTIMER_OBJ_CACHE_SAFE=y
# CONFIG_GPTIMER_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:GPTimer Configurations

#
# ESP-Driver:I2C Configurations
#
# CONFIG_I2C_ISR_IRAM_SAFE is not set
# CONFIG_I2C_ENABLE_DEBUG_LOG is not set
# CONFIG_I2C_ENABLE_SLAVE_DRIVER_VERSION_2 is not set
CONFIG_I2C_MASTER_ISR_HANDLER_IN_IRAM=y
# end of ESP-Driver:I2C Configurations

#
# ESP-Driver:I2S Configurations
#
# CONFIG_I2S_ISR_IRAM_SAFE is not set
# CONFIG_I2S_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:I2S Configurations

#
# ESP-Driver:ISP Configurations
#
# CONFIG_ISP_ISR_IRAM_SAFE is not set
# CONFIG_ISP_CTRL_FUNC_IN_IRAM is not set
# end of ESP-Driver:ISP Configurations

#
# ESP-Driver:JPEG-Codec Configurations
#
# CONFIG_JPEG_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:JPEG-Codec Configurations

#
# ESP-Driver:LEDC Configurations
#
# CONFIG_LEDC_CTRL_FUNC_IN_IRAM is not set
# end of ESP-Driver:LEDC Configurations

#
# ESP-Driver:MCPWM Configurations
#
CONFIG_MCPWM_ISR_HANDLER_IN_IRAM=y
# CONFIG_MCPWM_ISR_CACHE_SAFE is not set
# CONFIG_MCPWM_CTRL_FUNC_IN_IRAM is not set
# default:
CONFIG_MCPWM_OBJ_CACHE_SAFE=y
# CONFIG_MCPWM_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:MCPWM Configurations

#
# ESP-Driver:Parallel IO Configurations
#
CONFIG_PARLIO_TX_ISR_HANDLER_IN_IRAM=y
CONFIG_PARLIO_RX_ISR_HANDLER_IN_IRAM=y
# CONFIG_PARLIO_TX_ISR_CACHE_SAFE is not set
# CONFIG_PARLIO_RX_ISR_CACHE_SAFE is not set
# default:
CONFIG_PARLIO_OBJ_CACHE_SAFE=y
# CONFIG_PARLIO_ENABLE_DEBUG_LOG is not set
# CONFIG_PARLIO_ISR_IRAM_SAFE is not set
# end of ESP-Driver:Parallel IO Configurations

#
# ESP-Driver:PCNT Configurations
#
# CONFIG_PCNT_CTRL_FUNC_IN_IRAM is not set
# CONFIG_PCNT_ISR_IRAM_SAFE is not set
# CONFIG_PCNT_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:PCNT Configurations

#
# ESP-Driver:RMT Configurations
#
CONFIG_RMT_ENCODER_FUNC_IN_IRAM=y
CONFIG_RMT_TX_ISR_HANDLER_IN_IRAM=y
CONFIG_RMT_RX_ISR_HANDLER_IN_IRAM=y
# CONFIG_RMT_RECV_FUNC_IN_IRAM is not set
# CONFIG_RMT_TX_ISR_CACHE_SAFE is not set
# CONFIG_RMT_RX_ISR_CACHE_SAFE is not set
# default:
CONFIG_RMT_OBJ_CACHE_SAFE=y
# CONFIG_RMT_ENABLE_DEBUG_LOG is not set
# CONFIG_RMT_ISR_IRAM_SAFE is not set
# end of ESP-Driver:RMT Configurations

#
# ESP-Driver:Sigma Delta Modulator Configurations
#
# CONFIG_SDM_CTRL_FUNC_IN_IRAM is not set
# CONFIG_SDM_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:Sigma Delta Modulator Configurations

