vedderb/vesc_express/sdkconfig.defaults.esp32p4_nrw32n16c6
#
# Features here require specific hardware (READ DOCS FIRST!)
#
# CONFIG_SPI_FLASH_HPM_ENA is not set
CONFIG_SPI_FLASH_HPM_AUTO=y
# CONFIG_SPI_FLASH_HPM_DIS is not set
# default:
CONFIG_SPI_FLASH_HPM_ON=y
CONFIG_SPI_FLASH_HPM_DC_AUTO=y
# CONFIG_SPI_FLASH_HPM_DC_DISABLE is not set
# CONFIG_SPI_FLASH_AUTO_SUSPEND is not set
CONFIG_SPI_FLASH_SUSPEND_TSUS_VAL_US=50
# CONFIG_SPI_FLASH_FORCE_ENABLE_XMC_C_SUSPEND is not set
# CONFIG_SPI_FLASH_FORCE_ENABLE_C6_H2_SUSPEND is not set
CONFIG_SPI_FLASH_PLACE_FUNCTIONS_IN_IRAM=y
# end of Optional and Experimental Features (READ DOCS FIRST)
# end of Main Flash configuration

#
# SPI Flash driver
#
# CONFIG_SPI_FLASH_VERIFY_WRITE is not set
# CONFIG_SPI_FLASH_ENABLE_COUNTERS is not set
CONFIG_SPI_FLASH_ROM_DRIVER_PATCH=y
CONFIG_SPI_FLASH_DANGEROUS_WRITE_ABORTS=y
# CONFIG_SPI_FLASH_DANGEROUS_WRITE_FAILS is not set
# CONFIG_SPI_FLASH_DANGEROUS_WRITE_ALLOWED is not set
# CONFIG_SPI_FLASH_BYPASS_BLOCK_ERASE is not set
CONFIG_SPI_FLASH_YIELD_DURING_ERASE=y
CONFIG_SPI_FLASH_ERASE_YIELD_DURATION_MS=20
CONFIG_SPI_FLASH_ERASE_YIELD_TICKS=1
CONFIG_SPI_FLASH_WRITE_CHUNK_SIZE=8192
# CONFIG_SPI_FLASH_SIZE_OVERRIDE is not set
# CONFIG_SPI_FLASH_CHECK_ERASE_TIMEOUT_DISABLED is not set
# CONFIG_SPI_FLASH_OVERRIDE_CHIP_DRIVER_LIST is not set

#
# Auto-detect flash chips
#
# default:
CONFIG_SPI_FLASH_VENDOR_XMC_SUPPORT_ENABLED=y
# default:
CONFIG_SPI_FLASH_VENDOR_GD_SUPPORT_ENABLED=y
# CONFIG_SPI_FLASH_SUPPORT_ISSI_CHIP is not set
# CONFIG_SPI_FLASH_SUPPORT_MXIC_CHIP is not set
CONFIG_SPI_FLASH_SUPPORT_GD_CHIP=y
# CONFIG_SPI_FLASH_SUPPORT_WINBOND_CHIP is not set
CONFIG_SPI_FLASH_SUPPORT_BOYA_CHIP=y
# CONFIG_SPI_FLASH_SUPPORT_TH_CHIP is not set
# end of Auto-detect flash chips

CONFIG_SPI_FLASH_ENABLE_ENCRYPTED_READ_WRITE=y
# end of SPI Flash driver

#
# SPIFFS Configuration
#
CONFIG_SPIFFS_MAX_PARTITIONS=3

#
# SPIFFS Cache Configuration
#
CONFIG_SPIFFS_CACHE=y
CONFIG_SPIFFS_CACHE_WR=y
# CONFIG_SPIFFS_CACHE_STATS is not set
# end of SPIFFS Cache Configuration

CONFIG_SPIFFS_PAGE_CHECK=y
CONFIG_SPIFFS_GC_MAX_RUNS=10
# CONFIG_SPIFFS_GC_STATS is not set
CONFIG_SPIFFS_PAGE_SIZE=256
CONFIG_SPIFFS_OBJ_NAME_LEN=32
# CONFIG_SPIFFS_FOLLOW_SYMLINKS is not set
CONFIG_SPIFFS_USE_MAGIC=y
CONFIG_SPIFFS_USE_MAGIC_LENGTH=y
CONFIG_SPIFFS_META_LENGTH=4
CONFIG_SPIFFS_USE_MTIME=y

#
# Debug Configuration
#
# CONFIG_SPIFFS_DBG is not set
# CONFIG_SPIFFS_API_DBG is not set
# CONFIG_SPIFFS_GC_DBG is not set
# CONFIG_SPIFFS_CACHE_DBG is not set
# CONFIG_SPIFFS_CHECK_DBG is not set
# CONFIG_SPIFFS_TEST_VISUALISATION is not set
# end of Debug Configuration
# end of SPIFFS Configuration

#
# TCP Transport
#

#
# Websocket
#
CONFIG_WS_TRANSPORT=y
CONFIG_WS_BUFFER_SIZE=1024
# CONFIG_WS_DYNAMIC_BUFFER is not set
# end of Websocket
# end of TCP Transport

#
# Ultra Low Power (ULP) Co-processor
#
# CONFIG_ULP_COPROC_ENABLED is not set

#
# ULP Debugging Options
#
# end of ULP Debugging Options
# end of Ultra Low Power (ULP) Co-processor

#
# Unity unit testing library
#
CONFIG_UNITY_ENABLE_FLOAT=y
CONFIG_UNITY_ENABLE_DOUBLE=y
# CONFIG_UNITY_ENABLE_64BIT is not set
# CONFIG_UNITY_ENABLE_COLOR is not set
CONFIG_UNITY_ENABLE_IDF_TEST_RUNNER=y
# CONFIG_UNITY_ENABLE_FIXTURE is not set
# CONFIG_UNITY_ENABLE_BACKTRACE_ON_FAIL is not set
# CONFIG_UNITY_TEST_ORDER_BY_FILE_PATH_AND_LINE is not set
# end of Unity unit testing library

#
# USB-OTG
#
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=256
CONFIG_USB_HOST_HW_BUFFER_BIAS_BALANCED=y
# CONFIG_USB_HOST_HW_BUFFER_BIAS_IN is not set
# CONFIG_USB_HOST_HW_BUFFER_BIAS_PERIODIC_OUT is not set

#
# Hub Driver Configuration
#

#
# Root Port configuration
#
CONFIG_USB_HOST_DEBOUNCE_DELAY_MS=250
CONFIG_USB_HOST_RESET_HOLD_MS=30
CONFIG_USB_HOST_RESET_RECOVERY_MS=30
CONFIG_USB_HOST_SET_ADDR_RECOVERY_MS=10
# end of Root Port configuration

# CONFIG_USB_HOST_HUBS_SUPPORTED is not set
# end of Hub Driver Configuration

# CONFIG_USB_HOST_ENABLE_ENUM_FILTER_CALLBACK is not set
# CONFIG_USB_HOST_DWC_DMA_CAP_MEMORY_IN_PSRAM is not set
# default:
CONFIG_USB_OTG_SUPPORTED=y
# end of USB-OTG

#
# Virtual file system
#
CONFIG_VFS_SUPPORT_IO=y
CONFIG_VFS_SUPPORT_DIR=y
CONFIG_VFS_SUPPORT_SELECT=y
CONFIG_VFS_SUPPRESS_SELECT_DEBUG_OUTPUT=y
# CONFIG_VFS_SELECT_IN_RAM is not set
CONFIG_VFS_SUPPORT_TERMIOS=y
CONFIG_VFS_MAX_COUNT=8

#
# Host File System I/O (Semihosting)
#
CONFIG_VFS_SEMIHOSTFS_MAX_MOUNT_POINTS=1
# end of Host File System I/O (Semihosting)

CONFIG_VFS_INITIALIZE_DEV_NULL=y
# end of Virtual file system

#
# Wear Levelling
#
# CONFIG_WL_SECTOR_SIZE_512 is not set
CONFIG_WL_SECTOR_SIZE_4096=y
# default:
CONFIG_WL_SECTOR_SIZE=4096
# end of Wear Levelling

#
# Wi-Fi Provisioning Manager
#
CONFIG_WIFI_PROV_SCAN_MAX_ENTRIES=16
CONFIG_WIFI_PROV_AUTOSTOP_TIMEOUT=30
# default:
# CONFIG_WIFI_PROV_BLE_BONDING is not set
# default:
# CONFIG_WIFI_PROV_BLE_FORCE_ENCRYPTION is not set
# default:
# CONFIG_WIFI_PROV_BLE_NOTIFY is not set
# default:
# CONFIG_WIFI_PROV_KEEP_BLE_ON_AFTER_PROV is not set
CONFIG_WIFI_PROV_STA_ALL_CHANNEL_SCAN=y
# CONFIG_WIFI_PROV_STA_FAST_SCAN is not set
# end of Wi-Fi Provisioning Manager

#
# CMake Utilities
#
# CONFIG_CU_RELINKER_ENABLE is not set
# CONFIG_CU_DIAGNOSTICS_COLOR_NEVER is not set
CONFIG_CU_DIAGNOSTICS_COLOR_ALWAYS=y
# CONFIG_CU_DIAGNOSTICS_COLOR_AUTO is not set
# CONFIG_CU_GCC_LTO_ENABLE is not set
# CONFIG_CU_GCC_STRING_1BYTE_ALIGN is not set
# end of CMake Utilities

#
# eppp_link
#
# default:
# CONFIG_EPPP_LINK_USES_PPP is not set
# default:
CONFIG_EPPP_LINK_DEVICE_UART=y
# default:
# CONFIG_EPPP_LINK_DEVICE_SPI is not set
# default:
# CONFIG_EPPP_LINK_DEVICE_SDIO is not set
# default:
# CONFIG_EPPP_LINK_DEVICE_ETH is not set
# default:
CONFIG_EPPP_LINK_CONN_MAX_RETRY=6
# default:
# CONFIG_EPPP_LINK_CHANNELS_SUPPORT is not set
# end of eppp_link

CONFIG_ESP_HOSTED=y
CONFIG_ESP_HOSTED_HOST=y
# CONFIG_ESP_HOSTED_CP is not set

#
# Common config (Host & Coprocessor)
#
# default:
CONFIG_ESP_HOSTED_AUTO_CALL_INIT_BEFORE_APP_MAIN=y
# end of Common config (Host & Coprocessor)

CONFIG_ESP_HOSTED_P4_DEV_BOARD_NONE=y
# CONFIG_ESP_HOSTED_P4_DEV_BOARD_FUNC_BOARD is not set

#
# Configure host
#
CONFIG_ESP_HOSTED_HOST_TYPE_MCU=y
# CONFIG_ESP_HOSTED_HOST_TYPE_POSIX is not set
# CONFIG_ESP_HOSTED_HOST_TYPE_LINUX_KMOD is not set
# default:
CONFIG_ESP_HOSTED_CP_TARGET_FROM_WIFI_REMOTE=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
# CONFIG_ESP_HOSTED_CP_TARGET_ESP32H2 is not set
# CONFIG_ESP_HOSTED_CP_TARGET_ESP32H4 is not set
# default:
CONFIG_ESP_HOSTED_IDF_SLAVE_TARGET="esp32c6"
# default:
CONFIG_ESP_HOSTED_PRIV_ENABLE_WIFI_OPTIONS=y
# CONFIG_ESP32P4_EYE_C6_BOARD is not set
# CONFIG_ESP_HOSTED_P4_C6_CORE_BOARD is not set

#
# Host core
#
# default:
CONFIG_ESP_HOSTED_HOST_CORE=y
# default:
CONFIG_ESP_HOSTED_HOST_CORE_READY=y
# default:
CONFIG_ESP_HOSTED_HOST_AUTO_FEAT_INIT=y

#
# Co-processor connection
#
CONFIG_ESP_HOSTED_HOST_CP_RESET_STRATEGY_ALWAYS=y
# CONFIG_ESP_HOSTED_HOST_CP_RESET_STRATEGY_ONLY_IF_NECESSARY is not set
# default:
CONFIG_ESP_HOSTED_HOST_CP_RESET_SETTLE_MS=1500
# default:
CONFIG_ESP_HOSTED_HOST_CP_BRINGUP_TIMEOUT_MS=5000
# default:
CONFIG_ESP_HOSTED_HOST_CP_BRINGUP_ON_TIMEOUT_NONE=y
# default:
# CONFIG_ESP_HOSTED_HOST_CP_BRINGUP_ON_TIMEOUT_REATTEMPT is not set
# default:
# CONFIG_ESP_HOSTED_HOST_CP_BRINGUP_ON_TIMEOUT_RESTART is not set
# default:
CONFIG_ESP_HOSTED_HOST_TRANSPORT_RESTART_ON_FAILURE=y
# end of Co-processor connection

#
# Debug
#
# default:
# CONFIG_ESP_HOSTED_HOST_LOG_LEVEL_NONE is not set
# default:
# CONFIG_ESP_HOSTED_HOST_LOG_LEVEL_ERROR is not set
# default:
# CONFIG_ESP_HOSTED_HOST_LOG_LEVEL_WARN is not set
# default:
CONFIG_ESP_HOSTED_HOST_LOG_LEVEL_INFO=y
# default:
# CONFIG_ESP_HOSTED_HOST_LOG_LEVEL_DEBUG is not set
# default:
# CONFIG_ESP_HOSTED_HOST_LOG_LEVEL_VERBOSE is not set
# default:
# CONFIG_ESP_HOSTED_HOST_DEBUG_STATS is not set
# default:
# CONFIG_ESP_HOSTED_HOST_DEBUG_LOOPBACK is not set
# end of Debug

#
# Tuning
#
# default:
CONFIG_ESP_HOSTED_HOST_RPC_TIMEOUT_MS=5000
# default:
CONFIG_ESP_HOSTED_HOST_RPC_MAX_PENDING=16
# default:
CONFIG_ESP_HOSTED_HOST_DEFLT_TASK_STACK_BYTES=4096
# default:
CONFIG_ESP_HOSTED_HOST_DEFLT_TASK_PRIORITY=22
# default:
CONFIG_ESP_HOSTED_DFLT_TASK_STACK=4096
CONFIG_ESP_HOSTED_DFLT_TASK_FROM_SPIRAM=y
# end of Tuning

#
# Traffic Shaping
#
# default:
CONFIG_ESP_HOSTED_HOST_TO_ESP_WIFI_DATA_THROTTLE=y
# default:
CONFIG_ESP_HOSTED_PRIV_WIFI_TX_SDIO_HIGH_THRESHOLD=80
# default:
CONFIG_ESP_HOSTED_TO_WIFI_DATA_THROTTLE_HIGH_THRESHOLD=80
# default:
CONFIG_ESP_HOSTED_TO_WIFI_DATA_THROTTLE_LOW_THRESHOLD=60
# end of Traffic Shaping
# end of Host core

#
# Host transport
#
# default:
CONFIG_ESP_HOSTED_HOST_TRANSPORT_MCU=y
# default:
CONFIG_ESP_HOSTED_HOST_TRANSPORT_MCU_READY=y
# default:
CONFIG_ESP_HOSTED_HOST_PRIV_SDIO_OPTION=y
# CONFIG_ESP_HOSTED_HOST_TRANSPORT_BUS_SPI is not set
CONFIG_ESP_HOSTED_HOST_TRANSPORT_BUS_SDIO=y
# CONFIG_ESP_HOSTED_HOST_TRANSPORT_BUS_SPI_HD is not set
# CONFIG_ESP_HOSTED_HOST_TRANSPORT_BUS_UART is not set
# default:
CONFIG_ESP_HOSTED_HOST_TRANSPORT_BUS_SDIO_READY=y
CONFIG_ESP_HOSTED_HOST_RESET_GPIO=54
# default:
CONFIG_ESP_HOSTED_HOST_RESET_ACTIVE_LOW=y

#
# SDIO Configuration
#
# CONFIG_ESP_HOSTED_SDIO_SLOT_0 is not set
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
# default:
CONFIG_ESP_HOSTED_HOST_SDIO_SLOT=1
# default:
# CONFIG_ESP_HOSTED_SD_PWR_CTRL_LDO_INTERNAL_IO is not set
CONFIG_ESP_HOSTED_HOST_SDIO_CLK_KHZ=40000
# CONFIG_ESP_HOSTED_HOST_SDIO_BUS_WIDTH_1 is not set
CONFIG_ESP_HOSTED_HOST_SDIO_BUS_WIDTH_4=y
# default:
CONFIG_ESP_HOSTED_HOST_SDIO_BUS_WIDTH=4
# default:
CONFIG_ESP_HOSTED_SDIO_CMD_GPIO_RANGE_MIN=0
# default:
CONFIG_ESP_HOSTED_SDIO_CMD_GPIO_RANGE_MAX=100
# default:
CONFIG_ESP_HOSTED_SDIO_CLK_GPIO_RANGE_MIN=0
# default:
CONFIG_ESP_HOSTED_SDIO_CLK_GPIO_RANGE_MAX=100
# default:
CONFIG_ESP_HOSTED_SDIO_D0_GPIO_RANGE_MIN=0
# default:
CONFIG_ESP_HOSTED_SDIO_D0_GPIO_RANGE_MAX=100
# default:
CONFIG_ESP_HOSTED_SDIO_D1_GPIO_RANGE_MIN=0
# default:
CONFIG_ESP_HOSTED_SDIO_D1_GPIO_RANGE_MAX=100
# default:
CONFIG_ESP_HOSTED_SDIO_D2_GPIO_RANGE_MIN=0
# default:
CONFIG_ESP_HOSTED_SDIO_D2_GPIO_RANGE_MAX=100
# default:
CONFIG_ESP_HOSTED_SDIO_D3_GPIO_RANGE_MIN=0
# default:
CONFIG_ESP_HOSTED_SDIO_D3_GPIO_RANGE_MAX=100

#
# GPIO Configuration
#
# default:
CONFIG_ESP_HOSTED_SDIO_RESET_SLAVE_GPIO_MIN=-1
# default:
CONFIG_ESP_HOSTED_SDIO_RESET_SLAVE_GPIO_MAX=100
# CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH is not set
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_LOW=y
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_CMD=19
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_CLK=18
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D0=14
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D1=15
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D2=16
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D3=17
# end of GPIO Configuration

# CONFIG_ESP_HOSTED_HOST_SDIO_RX_NONE is not set
# CONFIG_ESP_HOSTED_HOST_SDIO_RX_MAX_SIZE is not set
CONFIG_ESP_HOSTED_HOST_SDIO_RX_STREAMING_MODE=y
# default:
# CONFIG_ESP_HOSTED_HOST_SDIO_AGGR_TRACE is not set
CONFIG_ESP_HOSTED_HOST_SDIO_TX_Q_SIZE=20
CONFIG_ESP_HOSTED_HOST_SDIO_RX_Q_SIZE=20
CONFIG_ESP_HOSTED_HOST_SDIO_RX_STAGING_SLOTS=4
# end of SDIO Configuration

#
# Transport Test
#
# default:
CONFIG_ESP_HOSTED_RAW_THROUGHPUT_TRANSPORT=y
# default:
CONFIG_ESP_HOSTED_RAW_TP_REPORT_INTERVAL=1
# default:
CONFIG_ESP_HOSTED_RAW_TP_HOST_TO_ESP_PKT_LEN=1460
# end of Transport Test

# default:
CONFIG_ESP_HOSTED_HOST_VSERIAL_MCU=y
# default:
CONFIG_ESP_HOSTED_HOST_VSERIAL_MCU_READY=y
# end of Host transport

#
# RPC Support
#
# default:
CONFIG_ESP_HOSTED_HOST_FEAT_RPC=y
# default:
CONFIG_ESP_HOSTED_HOST_FEAT_RPC_READY=y
# default:
CONFIG_ESP_HOSTED_HOST_RPC_READY_WAIT_MS=5000
# default:
CONFIG_ESP_HOSTED_HOST_FEAT_RPC_EXT_V2=y
# default:
CONFIG_ESP_HOSTED_HOST_FEAT_RPC_EXT_V2_READY=y
# end of RPC Support

#
# Features
#
# default:
CONFIG_ESP_HOSTED_HOST_FEAT_SYSTEM=y
# default:
CONFIG_ESP_HOSTED_HOST_FEAT_SYSTEM_AUTO_INIT=y
# default:
CONFIG_ESP_HOSTED_HOST_FEAT_OTA=y
# default:
CONFIG_ESP_HOSTED_HOST_FEAT_OTA_AUTO_INIT=y
# default:
CONFIG_ESP_HOSTED_HOST_FEAT_OTA_READY=y
# default:
CONFIG_ESP_HOSTED_HOST_FEAT_SYSTEM_READY=y
# default:
CONFIG_ESP_HOSTED_HOST_FEAT_WIFI=y
# default:
CONFIG_ESP_HOSTED_HOST_FEAT_WIFI_AUTO_INIT=y
# default:
# CONFIG_ESP_HOSTED_HOST_FEAT_WIFI_DECODE_RESERVED_FIELD is not set
# default:
# CONFIG_ESP_HOSTED_HOST_FEAT_WIFI_STA_AUTO_CONNECT_ON_START is not set
# default:
# CONFIG_ESP_HOSTED_HOST_FEAT_WIFI_STA_AUTO_RECONNECT_ON_DISCONNECT is not set
# default:
# CONFIG_ESP_HOSTED_HOST_FEAT_WIFI_EXT_ENT is not set
# default:
# CONFIG_ESP_HOSTED_HOST_FEAT_WIFI_EXT_ITWT is not set
# default:
# CONFIG_ESP_HOSTED_HOST_FEAT_WIFI_EXT_DPP is not set
# default:
CONFIG_ESP_HOSTED_HOST_FEAT_WIFI_READY=y
CONFIG_ESP_HOSTED_HOST_FEAT_BT=y
CONFIG_ESP_HOSTED_HOST_FEAT_BT_AUTO_INIT=y
# CONFIG_ESP_HOSTED_HOST_FEAT_BT_AUTO_CONTROLLER_INIT is not set
# default:
# CONFIG_ESP_HOSTED_HOST_FEAT_BT_AUTO_SET_MAC is not set
# default:
CONFIG_ESP_HOSTED_HOST_FEAT_BT_READY=y
# default:
# CONFIG_ESP_HOSTED_HOST_FEAT_OPENTHREAD is not set
# default:
# CONFIG_ESP_HOSTED_HOST_FEAT_PEER_DATA is not set
# default:
# CONFIG_ESP_HOSTED_HOST_FEAT_NW_SPLIT is not set
# default:
# CONFIG_ESP_HOSTED_HOST_FEAT_GPIO_EXP is not set
# default:
# CONFIG_ESP_HOSTED_HOST_FEAT_CP_EXT_COEX is not set
# default:
# CONFIG_ESP_HOSTED_HOST_FEAT_HEARTBEAT is not set
# default:
# CONFIG_ESP_HOSTED_HOST_FEAT_MEM_MONITOR is not set
# default:
# CONFIG_ESP_HOSTED_HOST_FEAT_POWER_SAVE is not set
# default:
# CONFIG_ESP_HOSTED_HOST_FEAT_CLI is not set
# end of Features

#
# Port
#
# default:
CONFIG_ESP_HOSTED_HOST_PORT_TYPE_ESP_IDF=y

#
# Port APIs (EH_HOST_PORT_HAS_*)
#
# default:
CONFIG_EH_HOST_PORT_HAS_TASK=y
# default:
CONFIG_EH_HOST_PORT_HAS_MUTEX=y
# default:
CONFIG_EH_HOST_PORT_HAS_COND=y
# default:
CONFIG_EH_HOST_PORT_HAS_SEM=y
# default:
CONFIG_EH_HOST_PORT_HAS_SEM_POST_FROM_ISR=y
# default:
CONFIG_EH_HOST_PORT_HAS_TIMER=y
# default:
CONFIG_EH_HOST_PORT_HAS_TIME=y
# default:
CONFIG_EH_HOST_PORT_HAS_MEM=y
# default:
CONFIG_EH_HOST_PORT_HAS_DMA=y
CONFIG_EH_HOST_PORT_DMA_PREFER_SPIRAM=y
# default:
CONFIG_EH_HOST_PORT_HAS_LOG=y
# default:
CONFIG_EH_HOST_PORT_HAS_GPIO=y
# default:
CONFIG_EH_HOST_PORT_HAS_GPIO_INTR=y
# default:
CONFIG_EH_HOST_PORT_HAS_GPIO_HOLD=y
# default:
CONFIG_EH_HOST_PORT_HAS_POWER=y
# default:
CONFIG_EH_HOST_PORT_HAS_POWER_SAVE=y
# default:
CONFIG_EH_HOST_PORT_HAS_WAKEUP_REASON=y
# default:
CONFIG_EH_HOST_PORT_HAS_NETIF=y
# default:
CONFIG_EH_HOST_PORT_HAS_EVENT_BUS=y
# default:
CONFIG_EH_HOST_PORT_HAS_TRANSPORT_EVENTS=y
# default:
CONFIG_EH_HOST_PORT_HAS_SYSTEM_EVENTS=y
# default:
CONFIG_EH_HOST_PORT_HAS_WIFI_EVENTS=y
# default:
CONFIG_EH_HOST_PORT_HAS_NETIF_EVENTS=y
# default:
CONFIG_EH_HOST_PORT_HAS_PEER_DATA_EVENTS=y
# default:
CONFIG_EH_HOST_PORT_HAS_OTA_EVENTS=y
# default:
CONFIG_EH_HOST_PORT_HAS_POWER_EVENTS=y
# default:
CONFIG_EH_HOST_PORT_HAS_GPIO_EVENTS=y
# end of Port APIs (EH_HOST_PORT_HAS_*)
# end of Port

# default:
CONFIG_ESP_HOSTED_HOST_COMPAT=y
# end of Configure host

#
# ESP LCD TOUCH
#
CONFIG_ESP_LCD_TOUCH_MAX_POINTS=5
CONFIG_ESP_LCD_TOUCH_MAX_BUTTONS=1
# end of ESP LCD TOUCH

#
# ESP LCD TOUCH - CST816S
#
# CONFIG_ESP_LCD_TOUCH_CST816S_DISABLE_READ_ID is not set
# end of ESP LCD TOUCH - CST816S

#
# Wi-Fi Remote
#
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
# default:
CONFIG_ESP_WIFI_REMOTE_IDF_SPECIFIC_ADDED=y
# CONFIG_SLAVE_IDF_TARGET_ESP32 is not set
# CONFIG_SLAVE_IDF_TARGET_ESP32S2 is not set
# CONFIG_SLAVE_IDF_TARGET_ESP32C3 is not set
# CONFIG_SLAVE_IDF_TARGET_ESP32S3 is not set
# CONFIG_SLAVE_IDF_TARGET_ESP32C2 is not set
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
# CONFIG_SLAVE_IDF_TARGET_ESP32C5 is not set
# CONFIG_SLAVE_IDF_TARGET_ESP32C61 is not set
# default:
CONFIG_SLAVE_SOC_WIFI_SUPPORTED=y
# default:
CONFIG_SLAVE_SOC_WIFI_WAPI_SUPPORT=y
# default:
CONFIG_SLAVE_SOC_WIFI_CSI_SUPPORT=y
# default:
CONFIG_SLAVE_SOC_WIFI_MESH_SUPPORT=y
# default:
CONFIG_SLAVE_SOC_WIFI_LIGHT_SLEEP_CLK_WIDTH=12
# default:
CONFIG_SLAVE_SOC_WIFI_HW_TSF=y
# default:
CONFIG_SLAVE_SOC_WIFI_FTM_SUPPORT=y
# default:
CONFIG_SLAVE_FREERTOS_UNICORE=y
# default:
CONFIG_SLAVE_SOC_WIFI_GCMP_SUPPORT=y
# default:
CONFIG_SLAVE_SOC_WIFI_TXOP_SUPPORT=y
# default:
CONFIG_SLAVE_IDF_TARGET_ARCH_RISCV=y
# default:
CONFIG_SLAVE_SOC_WIFI_HE_SUPPORT=y
# default:
CONFIG_SLAVE_SOC_WIFI_MAC_VERSION_NUM=2

